<?php

function formatDate($date) {
        $ar= explode("-",$date);
        $months=array("01"=>"января","02"=>"февраля","03"=>"марта","04"=>"апреля","05"=>"мая","06"=>"июня","07"=>"июля","08"=>"августа","09"=>"сентября","10"=>"октября","11"=>"ноября","12"=>"декабря");
        return $ar[2]." ".$months[$ar[1]]." ".$ar[0];
        
}
       
function makePul($s)
{
	$trans=array("а"=>"a","б"=>"b","в"=>"v","г"=>"g","д"=>"d","е"=>"e","ж"=>"g","з"=>"z","ё"=>"e","и"=>"i","к"=>"k","л"=>"l","м"=>"m","н"=>"n","о"=>"o","п"=>"p","р"=>"r","с"=>"s","т"=>"t","у"=>"y","ф"=>"f","х"=>"h","ч"=>"ch","ш"=>"sh","щ"=>"sch","ь"=>"","ъ"=>"","э"=>"e","ю"=>"yu","я"=>"ya","й"=>"j","ц"=>"c","ы"=>"u");
            
        $str=mb_ereg_replace("[^a-zA-Zа-яА-Я0-9 _]"," ",$s);

	$str=mb_ereg_replace("^\s+","",$str);
	$str=mb_ereg_replace("\s+$","",$str);
	$str=mb_ereg_replace("\s+","_",$str);
	$str = ruslow($str);
/*	foreach ($trans as $k=>$v)
		$str = str_replace($k,$v,$str);
*/
	return $str;
}

function ruslow($s)
{
	$s = strtolower($s);
        
	$ar = array("Й=>й","Ц=>ц","У=>у","К=>к","Е=>е","Н"=>"н","Г"=>"г","Ш"=>"ш","Щ"=>"щ","З"=>"з","Х"=>"х","Ъ"=>"ъ","Ф"=>"ф","Ы"=>"ы","В"=>"в","А"=>"а","П"=>"п","Р"=>"р","О"=>"о","Л"=>"л","Д"=>"д","Ж"=>"ж","Э"=>"э","Я"=>"я","Ч"=>"ч","С"=>"с","М"=>"м","И"=>"и","Т"=>"т","Ь"=>"ь","Б"=>"б","Ю"=>"ю","Ё"=>"ё");
	foreach ($ar as $k=>$v)
		$s = str_replace($k,$v,$s);
	return $s;
}
